interfaces/src/main/resources/templates/GeefBetalingenHandicap/03.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://magda.vlaanderen.be/soczek/file/geefbetalingenhandicap/v03_00">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefBetalingenHandicap>
            <Verzoek>
                <Context>
                    <Naam>GeefBetalingenHandicap</Naam>
                    <Versie>03.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>Datum</Datum>
                            <Tijd>Tijd</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>Referte</Referte>
                        <Inhoud>
                            <Criteria>
                                <ConsultPaymentsCriteria>
                                    <ssin>INSZ</ssin>
                                    <handicapAuthenticSources>
                                    </handicapAuthenticSources>
                                    <period>
                                        <beginDatum>BeginDatum</beginDatum>
                                        <eindDatum>EindDatum</eindDatum>
                                    </period>
                                </ConsultPaymentsCriteria>
                            </Criteria>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefBetalingenHandicap>
    </soapenv:Body>
</soapenv:Envelope>